DeqingSun/arduino_core_ch32/system/CH585/SRC/StdPeriphDriver/CH585_usbhostClass.c
    PRINT("InitRootDev Err = %02X\n", (uint16_t)s);
#ifdef FOR_ROOT_UDISK_ONLY
    CHRV3DiskStatus = DISK_CONNECT;
#else
    ThisUsbDev.DeviceStatus = ROOT_DEV_FAILED;
#endif
    SetUsbSpeed(1); // Ĭ��Ϊȫ��
    return (s);
}

/*********************************************************************
 * @fn      InitDevOnHub
 *
 * @brief   ��ʼ��ö���ⲿHUB��Ķ���USB�豸
 *
 * @param   HubPortIndex    - ָ���ⲿHUB
 *
 * @return  ������
 */
uint8_t InitDevOnHub(uint8_t HubPortIndex)
{
    uint8_t i, s, cfg, dv_cls, if_cls;
    uint8_t ifc;
    PRINT("Init dev @ExtHub-port_%1d ", (uint16_t)HubPortIndex);
    if(HubPortIndex == 0)
    {
        return (ERR_USB_UNKNOWN);
    }
    SelectHubPort(HubPortIndex); // ѡ�����ָ����ROOT-HUB�˿ڵ��ⲿHUB��ָ���˿�,ѡ���ٶ�
    PRINT("GetDevDescr: ");
    s = CtrlGetDeviceDescr(); // ��ȡ�豸������
    if(s != ERR_SUCCESS)
    {
        return (s);
    }
    DevOnHubPort[HubPortIndex - 1].DeviceVID = ((uint16_t)((PUSB_DEV_DESCR)Com_Buffer)->idVendor); //����VID PID��Ϣ
    DevOnHubPort[HubPortIndex - 1].DevicePID = ((uint16_t)((PUSB_DEV_DESCR)Com_Buffer)->idProduct);

    dv_cls = ((PUSB_DEV_DESCR)Com_Buffer)->bDeviceClass; // �豸�����
    cfg = (1 << 4) + HubPortIndex;                       // �����һ��USB��ַ,�����ַ�ص�
    s = CtrlSetUsbAddress(cfg);                          // ����USB�豸��ַ
    if(s != ERR_SUCCESS)
    {
        return (s);
    }
    DevOnHubPort[HubPortIndex - 1].DeviceAddress = cfg; // ��������USB��ַ
    PRINT("GetCfgDescr: ");
    s = CtrlGetConfigDescr(); // ��ȡ����������
    if(s != ERR_SUCCESS)
    {
        return (s);
    }
    cfg = ((PUSB_CFG_DESCR)Com_Buffer)->bConfigurationValue;
    for(i = 0; i < ((PUSB_CFG_DESCR)Com_Buffer)->wTotalLength; i++)
    {
        PRINT("x%02X ", (uint16_t)(Com_Buffer[i]));
    }
    PRINT("\n");
    /* ��������������,��ȡ�˵�����/���˵��ַ/���˵��С��,���±���endp_addr��endp_size�� */
    if_cls = ((PXUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceClass; // �ӿ������
    if(dv_cls == 0x00 && if_cls == USB_DEV_CLASS_STORAGE)                   // ��USB�洢���豸,������ȷ����U��
    {
        AnalyzeBulkEndp(Com_Buffer, HubPortIndex);
        for(i = 0; i != 4; i++)
        {
            PRINT("%02x ", (uint16_t)DevOnHubPort[HubPortIndex - 1].GpVar[i]);
        }
        PRINT("\n");
        s = CtrlSetUsbConfig(cfg); // ����USB�豸����
        if(s == ERR_SUCCESS)
        {
            DevOnHubPort[HubPortIndex - 1].DeviceStatus = ROOT_DEV_SUCCESS;
            DevOnHubPort[HubPortIndex - 1].DeviceType = USB_DEV_CLASS_STORAGE;
            PRINT("USB-Disk Ready\n");
            SetUsbSpeed(1); // Ĭ��Ϊȫ��
            return (ERR_SUCCESS);
        }
    }
    else if((dv_cls == 0x00) && (if_cls == USB_DEV_CLASS_HID) && (((PXUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceSubClass <= 0x01)) // ��HID���豸,����/����
    {
        ifc = ((PXUSB_CFG_DESCR_LONG)Com_Buffer)->cfg_descr.bNumInterfaces;
        s = AnalyzeHidIntEndp(Com_Buffer, HubPortIndex); // ���������з�����HID�ж϶˵�ĵ�ַ
        PRINT("AnalyzeHidIntEndp %02x\n", (uint16_t)s);
        if_cls = ((PXUSB_CFG_DESCR_LONG)Com_Buffer)->itf_descr.bInterfaceProtocol;
        s = CtrlSetUsbConfig(cfg); // ����USB�豸����
        if(s == ERR_SUCCESS)
        {
            for(dv_cls = 0; dv_cls < ifc; dv_cls++)
            {
                s = CtrlGetHIDDeviceReport(dv_cls); //��ȡ����������
                if(s == ERR_SUCCESS)
                {
                    for(i = 0; i < 64; i++)
                    {
                        PRINT("x%02X ", (uint16_t)(Com_Buffer[i]));
                    }
                    PRINT("\n");
                }
            }
            //�豣��˵���Ϣ�Ա����������USB����
            DevOnHubPort[HubPortIndex - 1].DeviceStatus = ROOT_DEV_SUCCESS;
            if(if_cls == 1)
            {
                DevOnHubPort[HubPortIndex - 1].DeviceType = DEV_TYPE_KEYBOARD;
                //��һ����ʼ��,�����豸����ָʾ��LED��
                if(ifc > 1)
                {
                    PRINT("USB_DEV_CLASS_HID Ready\n");
                    DevOnHubPort[HubPortIndex - 1].DeviceType = USB_DEV_CLASS_HID; //����HID�豸
                }
                PRINT("USB-Keyboard Ready\n");
                SetUsbSpeed(1); // Ĭ��Ϊȫ��

                return (ERR_SUCCESS);
            }
            else if(if_cls == 2)
            {
                DevOnHubPort[HubPortIndex - 1].DeviceType = DEV_TYPE_MOUSE;
                //Ϊ���Ժ��ѯ���״̬,Ӧ�÷���������,ȡ���ж϶˿ڵĵ�ַ,���ȵ���Ϣ
                if(ifc > 1)
                {
                    PRINT("USB_DEV_CLASS_HID Ready\n");
                    DevOnHubPort[HubPortIndex - 1].DeviceType = USB_DEV_CLASS_HID; //����HID�豸
                }
                PRINT("USB-Mouse Ready\n");
                SetUsbSpeed(1); // Ĭ��Ϊȫ��

                return (ERR_SUCCESS);
            }
            s = ERR_USB_UNSUPPORT;
        }
    }
    else if(dv_cls == USB_DEV_CLASS_HUB) // ��HUB���豸,��������
    {
        DevOnHubPort[HubPortIndex - 1].DeviceType = USB_DEV_CLASS_HUB;
        PRINT("This program don't support Level 2 HUB\n"); // ��Ҫ֧�ֶ༶HUB������ο������������չ
        s = HubClearPortFeature(i, HUB_PORT_ENABLE);       // ��ֹHUB�˿�
        if(s != ERR_SUCCESS)
        {
            return (s);
        }
        s = ERR_USB_UNSUPPORT;
    }
    else //�����豸
    {
        AnalyzeBulkEndp(Com_Buffer, HubPortIndex); //�����������˵�
        for(i = 0; i != 4; i++)
        {
            PRINT("%02x ", (uint16_t)DevOnHubPort[HubPortIndex - 1].GpVar[i]);
        }
        PRINT("\n");
        s = CtrlSetUsbConfig(cfg); // ����USB�豸����
        if(s == ERR_SUCCESS)
        {
            //�豣��˵���Ϣ�Ա����������USB����
            DevOnHubPort[HubPortIndex - 1].DeviceStatus = ROOT_DEV_SUCCESS;
            DevOnHubPort[HubPortIndex - 1].DeviceType = dv_cls ? dv_cls : if_cls;
            SetUsbSpeed(1);       // Ĭ��Ϊȫ��
            return (ERR_SUCCESS); //δ֪�豸��ʼ���ɹ�
        }
    }
    PRINT("InitDevOnHub Err = %02X\n", (uint16_t)s);
    DevOnHubPort[HubPortIndex - 1].DeviceStatus = ROOT_DEV_FAILED;
    SetUsbSpeed(1); // Ĭ��Ϊȫ��
    return (s);
}

/*********************************************************************
 * @fn      EnumHubPort
 *
 * @brief   ö��ָ��ROOT-HUB�˿��ϵ��ⲿHUB�������ĸ����˿�,�����˿��������ӻ��Ƴ��¼�����ʼ������USB�豸
 *
 * @param   RootHubIndex    - ROOT_HUB0��ROOT_HUB1
 *
 * @return  ������
 */
uint8_t EnumHubPort()
{
    uint8_t i, s;

    for(i = 1; i <= ThisUsbDev.GpHUBPortNum; i++) // ��ѯ�������Ķ˿��Ƿ��б仯
    {
        SelectHubPort(0);        // ѡ�����ָ����ROOT-HUB�˿�,���õ�ǰUSB�ٶ��Լ��������豸��USB��ַ
        s = HubGetPortStatus(i); // ��ȡ�˿�״̬
        if(s != ERR_SUCCESS)
        {
            return (s); // �����Ǹ�HUB�Ͽ���
        }
        if(((Com_Buffer[0] & (1 << (HUB_PORT_CONNECTION & 0x07))) && (Com_Buffer[2] & (1 << (HUB_C_PORT_CONNECTION & 0x07)))) || (Com_Buffer[2] == 0x10))
        {                                                          // �������豸����
            DevOnHubPort[i - 1].DeviceStatus = ROOT_DEV_CONNECTED; // ���豸����
            DevOnHubPort[i - 1].DeviceAddress = 0x00;
            s = HubGetPortStatus(i); // ��ȡ�˿�״̬
            if(s != ERR_SUCCESS)
            {
                return (s); // �����Ǹ�HUB�Ͽ���
            }
            DevOnHubPort[i - 1].DeviceSpeed = Com_Buffer[1] & (1 << (HUB_PORT_LOW_SPEED & 0x07)) ? 0 : 1; // ���ٻ���ȫ��
            if(DevOnHubPort[i - 1].DeviceSpeed)
            {
                PRINT("Found full speed device on port %1d\n", (uint16_t)i);
            }
            else
            {
                PRINT("Found low speed device on port %1d\n", (uint16_t)i);
            }
            mDelaymS(200);                            // �ȴ��豸�ϵ��ȶ�
            s = HubSetPortFeature(i, HUB_PORT_RESET); // �����豸���ӵĶ˿ڸ�λ
            if(s != ERR_SUCCESS)
            {
                return (s); // �����Ǹ�HUB�Ͽ���
            }
            PRINT("Reset port and then wait in\n");
            do // ��ѯ��λ�˿�,ֱ����λ���,����ɺ��״̬��ʾ����
            {
                mDelaymS(1);
                s = HubGetPortStatus(i);
                if(s != ERR_SUCCESS)
                {
                    return (s); // �����Ǹ�HUB�Ͽ���
                }
            } while(Com_Buffer[0] & (1 << (HUB_PORT_RESET & 0x07))); // �˿����ڸ�λ��ȴ�
            mDelaymS(100);
            s = HubClearPortFeature(i, HUB_C_PORT_RESET);      // �����λ��ɱ�־
                                                               //             s = HubSetPortFeature( i, HUB_PORT_ENABLE );                              // ����HUB�˿�
            s = HubClearPortFeature(i, HUB_C_PORT_CONNECTION); // ������ӻ��Ƴ��仯��־
            if(s != ERR_SUCCESS)
            {
                return (s);
            }
            s = HubGetPortStatus(i); // �ٶ�ȡ״̬,�����豸�Ƿ���
            if(s != ERR_SUCCESS)
            {
                return (s);
            }
            if((Com_Buffer[0] & (1 << (HUB_PORT_CONNECTION & 0x07))) == 0)
            {
                DevOnHubPort[i - 1].DeviceStatus = ROOT_DEV_DISCONNECT; // �豸������
            }
            s = InitDevOnHub(i); // ��ʼ������USB�豸
            if(s != ERR_SUCCESS)
            {
                return (s);
            }
            SetUsbSpeed(1); // Ĭ��Ϊȫ��
        }
        else if(Com_Buffer[2] & (1 << (HUB_C_PORT_ENABLE & 0x07))) // �豸���ӳ���
        {
            HubClearPortFeature(i, HUB_C_PORT_ENABLE); // ������Ӵ����־
            PRINT("Device on port error\n");
            s = HubSetPortFeature(i, HUB_PORT_RESET); // �����豸���ӵĶ˿ڸ�λ
            if(s != ERR_SUCCESS)
                return (s); // �����Ǹ�HUB�Ͽ���
            do              // ��ѯ��λ�˿�,ֱ����λ���,����ɺ��״̬��ʾ����
            {
                mDelaymS(1);
                s = HubGetPortStatus(i);
                if(s != ERR_SUCCESS)
                    return (s);                                      // �����Ǹ�HUB�Ͽ���
            } while(Com_Buffer[0] & (1 << (HUB_PORT_RESET & 0x07))); // �˿����ڸ�λ��ȴ�
        }
        else if((Com_Buffer[0] & (1 << (HUB_PORT_CONNECTION & 0x07))) == 0) // �豸�Ѿ��Ͽ�
        {
            if(DevOnHubPort[i - 1].DeviceStatus >= ROOT_DEV_CONNECTED)
            {
                PRINT("Device on port %1d removed\n", (uint16_t)i);
            }
            DevOnHubPort[i - 1].DeviceStatus = ROOT_DEV_DISCONNECT; // ���豸����
            if(Com_Buffer[2] & (1 << (HUB_C_PORT_CONNECTION & 0x07)))
            {
                HubClearPortFeature(i, HUB_C_PORT_CONNECTION); // ����Ƴ��仯��־
            }
        }
    }
    return (ERR_SUCCESS); // ���ز����ɹ�
}

/*********************************************************************
 * @fn      EnumAllHubPort
 *
 * @brief   ö������ROOT-HUB�˿����ⲿHUB��Ķ���USB�豸
 *
 * @return  ������
 */
uint8_t EnumAllHubPort(void)
{
    uint8_t s;

